dog-app/app/controllers/dogs_controller.rb

INSERT INTO "dogs" ("name", "motto", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Istiak"], ["motto", "MLBD"], ["created_at", "2021-09-05 11:35:06.525487"], ["updated_at", "2021-09-05 11:35:06.525487"]]
---
  def create
    dog = Dog.create(dog_params)

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @dog = Dog.find(params[:id])

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "dogs" WHERE "dogs"."id" = ?  [["id", 5]]
---
  def destroy
    @dog = Dog.find(params[:id])
    @dog.destroy